# Extract, Transform Data

## Extract

In [1]:
#Import Dependenices
import pandas as pd

### Bring the data in

In [2]:
#Spreadsheet 1 (online)
csv_file = "../resources/australia online turnover.csv"
online_raw = pd.read_csv(csv_file)
online_raw.head(15)

,Unnamed: 0,Turnover; Total Sales (State); Online Food Retailing ;,Turnover; Total Sales (State); Online Non-Food Retailing ;,Turnover Sales; Total (State); Online Total (Industry) ;,Turnover; Total Sales (State); Online Food Retailing ;.1,Turnover; Total Sales (State); Online Non-Food Retailing ;.1,Turnover Sales; Total (State); Online Total (Industry) ;.1,Turnover; Total Sales (State); Online Food Retailing ;.2,Turnover; Total Sales (State); Online Non-Food Retailing ;.2,Turnover Sales; Total (State); Online Total (Industry) ;.2
0,Unit,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions
1,Series Type,Original,Original,Original,Seasonally Adjusted,Seasonally Adjusted,Seasonally Adjusted,Trend,Trend,Trend
2,Data Type,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW
3,Frequency,Month,Month,Month,Month,Month,Month,Month,Month,Month
4,Collection Month,1,1,1,1,1,1,1,1,1
5,Series Start,Jul-2013,Jul-2013,Jul-2013,Jul-2013,Jul-2013,Jul-2013,Jul-2013,Jul-2013,Jul-2013
6,Series End,Feb-2021,Feb-2021,Feb-2021,Feb-2021,Feb-2021,Feb-2021,Feb-2021,Feb-2021,Feb-2021
7,No. Obs,92,92,92,92,92,92,92,92,92
8,Series ID,A117725601W,A117725602X,A117725605F,A117725565X,A117725566A,A117725569J,A117725583C,A117725584F,A117725587L
9,Jul-2013,142.8,312.8,455.6,139.5,331.4,470.9,137.4,322.9,460.3
10,Aug-2013,151.4,308.2,459.6,146.7,329.6,476.3,137.6,333.6,471.2
11,Sep-2013,144.7,321.5,466.2,139.7,322.7,462.4,138.3,344.6,482.9
12,Oct-2013,132.2,368.8,501.0,127.9,351.6,479.5,139.4,356.2,495.6
13,Nov-2013,139.2,451.3,590.5,138.5,388.1,526.6,141.1,368.3,509.4
14,Dec-2013,134.9,495.1,630.0,131.1,381.7,512.7,143.9,380.2,524.0

In [3]:
#Spreasheet 2 (retail)
csv_file = "../resources/turnover by state.csv"
retail_raw = pd.read_csv(csv_file)
retail_raw.head(15)

,Unnamed: 0,Turnover ; New South Wales ; Total (Industry) ;,Turnover ; Victoria ; Total (Industry) ;,Turnover ; Queensland ; Total (Industry) ;,Turnover ; South Australia ; Total (Industry) ;,Turnover ; Western Australia ; Total (Industry) ;,Turnover ; Tasmania ; Total (Industry) ;,Turnover ; Northern Territory ; Total (Industry) ;,Turnover ; Australian Capital Territory ; Total (Industry) ;,Turnover ; Total (State) ; Total (Industry) ;,...,Turnover ; Total (State) ; Total (Industry) ;.1,Turnover ; New South Wales ; Total (Industry) ;.2,Turnover ; Victoria ; Total (Industry) ;.2,Turnover ; Queensland ; Total (Industry) ;.2,Turnover ; South Australia ; Total (Industry) ;.2,Turnover ; Western Australia ; Total (Industry) ;.2,Turnover ; Tasmania ; Total (Industry) ;.2,Turnover ; Northern Territory ; Total (Industry) ;.2,Turnover ; Australian Capital Territory ; Total (Industry) ;.2,Turnover ; Total (State) ; Total (Industry) ;.2
0,Unit,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,...,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions
1,Series Type,Original,Original,Original,Original,Original,Original,Original,Original,Original,...,Seasonally Adjusted,Trend,Trend,Trend,Trend,Trend,Trend,Trend,Trend,Trend
2,Data Type,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,...,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW
3,Frequency,Month,Month,Month,Month,Month,Month,Month,Month,Month,...,Month,Month,Month,Month,Month,Month,Month,Month,Month,Month
4,Collection Month,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
5,Series Start,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,...,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982
6,Series End,Mar-2021,Mar-2021,Mar-2021,Mar-2021,Mar-2021,Mar-2021,Mar-2021,Mar-2021,Mar-2021,...,Mar-2021,Mar-2021,Mar-2021,Mar-2021,Mar-2021,Mar-2021,Mar-2021,Mar-2021,Mar-2021,Mar-2021
7,No. Obs,468,468,468,468,468,468,468,468,468,...,468,468,468,468,468,468,468,468,468,468
8,Series ID,A3348645F,A3348708C,A3348771V,A3348834T,A3348897A,A3348960F,A3349023F,A3349086R,A3348582J,...,A3348585R,A3348651A,A3348714X,A3348777J,A3348840L,A3348903K,A3348966V,A3349029V,A3349092K,A3348588W
9,Apr-1982,1250.2,916.2,486.3,279.4,298.3,79.9,NaN,57.1,3396.4,...,3518.7,1310.2,933.2,511.7,284.0,315.3,81.3,NaN,57.2,3523.4
10,May-1982,1300.0,931.2,492.8,288.0,318.5,78.9,NaN,57.3,3497.9,...,3527.7,1307.4,938.9,513.6,287.6,316.4,81.6,NaN,57.4,3533.6
11,Jun-1982,1234.2,887.0,494.1,277.2,301.5,77.5,NaN,55.3,3357.8,...,3561.5,1305.1,946.3,515.7,291.8,317.8,81.9,NaN,57.7,3547.0
12,Jul-1982,1265.0,921.3,515.6,296.1,316.4,82.7,NaN,56.3,3486.8,...,3553.9,1302.4,954.3,517.3,296.3,319.1,82.2,NaN,58.2,3560.6
13,Aug-1982,1217.6,883.2,501.4,288.4,300.5,78.1,NaN,55.4,3355.9,...,3581.8,1298.1,963.6,518.0,301.1,320.4,82.4,NaN,58.9,3573.6
14,Sep-1982,1244.9,917.9,517.7,293.0,312.3,79.1,NaN,57.5,3454.3,...,3581.2,1293.1,974.1,517.9,306.2,321.6,82.4,NaN,60.0,3586.7

## Transform

In [4]:
# Create a filtered online dataframe from specific columns
online_columns = ["Unnamed: 0", "Turnover; Total Sales (State); Online Food Retailing ;.1", "Turnover; Total Sales (State); Online Non-Food Retailing ;.1", "Turnover Sales; Total (State); Online Total (Industry) ;.1"]
online_df = online_raw[online_columns].copy()
online_df.head(15)

,Unnamed: 0,Turnover; Total Sales (State); Online Food Retailing ;.1,Turnover; Total Sales (State); Online Non-Food Retailing ;.1,Turnover Sales; Total (State); Online Total (Industry) ;.1
0,Unit,$ Millions,$ Millions,$ Millions
1,Series Type,Seasonally Adjusted,Seasonally Adjusted,Seasonally Adjusted
2,Data Type,FLOW,FLOW,FLOW
3,Frequency,Month,Month,Month
4,Collection Month,1,1,1
5,Series Start,Jul-2013,Jul-2013,Jul-2013
6,Series End,Feb-2021,Feb-2021,Feb-2021
7,No. Obs,92,92,92
8,Series ID,A117725565X,A117725566A,A117725569J
9,Jul-2013,139.5,331.4,470.9
10,Aug-2013,146.7,329.6,476.3
11,Sep-2013,139.7,322.7,462.4
12,Oct-2013,127.9,351.6,479.5
13,Nov-2013,138.5,388.1,526.6
14,Dec-2013,131.1,381.7,512.7

In [5]:
# Create a filtered retail dataframe from specific columns
retail_columns = ["Unnamed: 0", "Turnover ;  Total (State) ;  Total (Industry) ;.1"]
retail_df = retail_raw[retail_columns].copy()
retail_df.head(15)

          Unnamed: 0 Turnover ;  Total (State) ;  Total (Industry) ;.1
0               Unit                                        $ Millions
1        Series Type                               Seasonally Adjusted
2          Data Type                                              FLOW
3          Frequency                                             Month
4   Collection Month                                                 1
5       Series Start                                          Apr-1982
6         Series End                                          Mar-2021
7            No. Obs                                               468
8          Series ID                                         A3348585R
9           Apr-1982                                            3518.7
10          May-1982                                            3527.7
11          Jun-1982                                            3561.5
12          Jul-1982                                            3553.9
13          Aug-1982                                            3581.8
14          Sep-1982                                            3581.2

In [6]:
# Remove unnecessary rows from online data
online_df = online_df.iloc[9:]
online_df.head(15)

,Unnamed: 0,Turnover; Total Sales (State); Online Food Retailing ;.1,Turnover; Total Sales (State); Online Non-Food Retailing ;.1,Turnover Sales; Total (State); Online Total (Industry) ;.1
9,Jul-2013,139.5,331.4,470.9
10,Aug-2013,146.7,329.6,476.3
11,Sep-2013,139.7,322.7,462.4
12,Oct-2013,127.9,351.6,479.5
13,Nov-2013,138.5,388.1,526.6
14,Dec-2013,131.1,381.7,512.7
15,Jan-2014,148.1,399.4,547.5
16,Feb-2014,154.9,426.4,581.3
17,Mar-2014,156.2,401.3,557.5
18,Apr-2014,161.3,412.0,573.3
19,May-2014,168.2,423.0,591.2
20,Jun-2014,165.2,432.1,597.4
21,Jul-2014,167.9,450.9,618.7
22,Aug-2014,165.9,464.5,630.3
23,Sep-2014,169.4,481.4,650.8

In [7]:
# Remove unnecessary rows from retail data
retail_df = retail_df.iloc[9:]
retail_df.head(15)

   Unnamed: 0 Turnover ;  Total (State) ;  Total (Industry) ;.1
9    Apr-1982                                            3518.7
10   May-1982                                            3527.7
11   Jun-1982                                            3561.5
12   Jul-1982                                            3553.9
13   Aug-1982                                            3581.8
14   Sep-1982                                            3581.2
15   Oct-1982                                            3595.6
16   Nov-1982                                            3651.7
17   Dec-1982                                            3650.4
18   Jan-1983                                            3695.6
19   Feb-1983                                            3821.0
20   Mar-1983                                            3822.8
21   Apr-1983                                            3885.2
22   May-1983                                            3793.2
23   Jun-1983                                            3839.4

In [8]:
#Rename columns for online data
online_df = online_df.rename(columns={"Unnamed: 0": "date",
                                        "Turnover; Total Sales (State); Online Food Retailing ;.1": "online_food_turnover",
                                        "Turnover; Total Sales (State); Online Non-Food Retailing ;.1": "online_nonfood_turnover",
                                        "Turnover Sales; Total (State); Online Total (Industry) ;.1": "online_total_turnover"})
online_df.head()

,date,online_food_turnover,online_nonfood_turnover,online_total_turnover
9,Jul-2013,139.5,331.4,470.9
10,Aug-2013,146.7,329.6,476.3
11,Sep-2013,139.7,322.7,462.4
12,Oct-2013,127.9,351.6,479.5
13,Nov-2013,138.5,388.1,526.6

In [9]:
#Rename columns for retail data
retail_df = retail_df.rename(columns={"Unnamed: 0": "date",
                                        "Turnover ;  Total (State) ;  Total (Industry) ;.1": "total_revenue_turnover"})
retail_df.head()

        date total_revenue_turnover
9   Apr-1982                 3518.7
10  May-1982                 3527.7
11  Jun-1982                 3561.5
12  Jul-1982                 3553.9
13  Aug-1982                 3581.8

In [10]:
#Look for the row that has July 2013 as its date value
retail_df[retail_df["date"] == "Jul-2013"]

         date total_revenue_turnover
384  Jul-2013                22042.6

In [11]:
# Remove all values before July 2013 for retailColumn_df 
retail_df = retail_df.iloc[375:]
retail_df.head()

         date total_revenue_turnover
384  Jul-2013                22042.6
385  Aug-2013                22204.7
386  Sep-2013                22356.5
387  Oct-2013                22431.6
388  Nov-2013                22630.9

In [12]:
#Join tables
combined_df = pd.merge(online_df, retail_df, on='date')
combined_df

,date,online_food_turnover,online_nonfood_turnover,online_total_turnover,total_revenue_turnover
0,Jul-2013,139.5,331.4,470.9,22042.6
1,Aug-2013,146.7,329.6,476.3,22204.7
2,Sep-2013,139.7,322.7,462.4,22356.5
3,Oct-2013,127.9,351.6,479.5,22431.6
4,Nov-2013,138.5,388.1,526.6,22630.9
...,...,...,...,...,...
87,Oct-2020,866.5,2215.9,3082.4,29601.6
88,Nov-2020,813.1,2223.3,3036.4,31571.4
89,Dec-2020,864.1,2107.2,2971.3,30450.9
90,Jan-2021,903.9,2117.1,3021.0,30538.5
91,Feb-2021,892.8,2060.6,2953.4,30300.6

In [14]:
#Split the date column into month and year for easy plotting
combined_df[['month','year']] = combined_df.date.str.split("-",expand=True,)
combined_df

,date,online_food_turnover,online_nonfood_turnover,online_total_turnover,total_revenue_turnover,month,year
0,Jul-2013,139.5,331.4,470.9,22042.6,Jul,2013
1,Aug-2013,146.7,329.6,476.3,22204.7,Aug,2013
2,Sep-2013,139.7,322.7,462.4,22356.5,Sep,2013
3,Oct-2013,127.9,351.6,479.5,22431.6,Oct,2013
4,Nov-2013,138.5,388.1,526.6,22630.9,Nov,2013
...,...,...,...,...,...,...,...
87,Oct-2020,866.5,2215.9,3082.4,29601.6,Oct,2020
88,Nov-2020,813.1,2223.3,3036.4,31571.4,Nov,2020
89,Dec-2020,864.1,2107.2,2971.3,30450.9,Dec,2020
90,Jan-2021,903.9,2117.1,3021.0,30538.5,Jan,2021
91,Feb-2021,892.8,2060.6,2953.4,30300.6,Feb,2021

In [15]:
# Re-arrange columns
combined_df = combined_df[['date', 'year', 'month', 'online_food_turnover', 'online_nonfood_turnover', 'online_total_turnover', 'total_revenue_turnover']]
combined_df

,date,year,month,online_food_turnover,online_nonfood_turnover,online_total_turnover,total_revenue_turnover
0,Jul-2013,2013,Jul,139.5,331.4,470.9,22042.6
1,Aug-2013,2013,Aug,146.7,329.6,476.3,22204.7
2,Sep-2013,2013,Sep,139.7,322.7,462.4,22356.5
3,Oct-2013,2013,Oct,127.9,351.6,479.5,22431.6
4,Nov-2013,2013,Nov,138.5,388.1,526.6,22630.9
...,...,...,...,...,...,...,...
87,Oct-2020,2020,Oct,866.5,2215.9,3082.4,29601.6
88,Nov-2020,2020,Nov,813.1,2223.3,3036.4,31571.4
89,Dec-2020,2020,Dec,864.1,2107.2,2971.3,30450.9
90,Jan-2021,2021,Jan,903.9,2117.1,3021.0,30538.5
91,Feb-2021,2021,Feb,892.8,2060.6,2953.4,30300.6

## Save cleaned dataframe as csv file

In [16]:
combined_df.to_csv('../resources/data.csv',index = False, header=True)